<script setup lang="ts">

</script>

<template>
  <main class="font-[Manrope] bg-[#FFFFFA] text-[#211D1D] px-2 sm:px-10">
	  <div class="py-2 sm:py-6">
		  <span
			  class="text-[10px] font-light text-[#211D1D] font-[Commissioner] sm:font-[Manrope] sm:text-sm"
		  >
			 Главная / О нас
		  </span>
	  </div>
	  <div class="grid grid-cols-1 items-center my-6 sm:gap-18 xl:grid-cols-2">
		  <div class="flex flex-col sm:gap-12">
			  <NuxtImg src="/logo-4.svg" alt="CASA AL MARE" width="908" height="123" />
			  <p class="text-sm font-light hidden sm:block">
				  Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития.
			  </p>
		  </div>
		  <div class="mt-4 sm:mt-0">
			  <NuxtImg src="/about.jpg" alt="about" width="909" height="692" class="rounded-lg" />
			  <p class="text-sm font-light mt-10 sm:hidden">
				  Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития.
			  </p>
		  </div>
	  </div>
  </main>
</template>

<style scoped>

</style>