<script setup lang="ts">
const breadcrumsItems: { name: string, path?: string }[] = [{ name: "Главная", path: "/" }, { name: "О нас" }]

const areImagesLoaded = ref(false)

const preloadImages = async () => {
	const loadImage = (url: string) => {
		return new Promise((resolve, reject) => {
			const img = new Image()
			img.src = url
			img.onload = resolve
			img.onerror = reject
		})
	}
	
	try {
		await Promise.all(['/about.jpg'].map(url => loadImage(url)))
		areImagesLoaded.value = true
	} catch (error) {
		console.error('Ошибка при загрузке изображений:', error)
		areImagesLoaded.value = true
	}
}

onMounted(() => {
	preloadImages()
})

</script>

<template>
  <main class="font-[Manrope] bg-[#FFFFFA] text-[#211D1D] px-2 sm:px-4">
	  <div class="py-2 sm:py-6">
		  <AppBreadcrumbs :items="breadcrumsItems" />
	  </div>
	  <div class="grid grid-cols-1 items-center my-6 sm:gap-18 xl:grid-cols-2">
		  <div class="flex flex-col sm:gap-12">
			  <NuxtImg src="/logo-4.svg" alt="CASA AL MARE" width="908" height="123" />
			  <p class="text-sm font-light hidden sm:block">
				  Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития.
			  </p>
		  </div>
		  <div class="mt-4 sm:mt-0">
			  <div v-if="!areImagesLoaded" class="aspect-[909/692] w-full bg-[#F9F6EC] rounded-lg" />
			  <NuxtImg v-else src="/about.jpg" alt="about" width="909" height="692" class="rounded-lg" />
			  <p class="text-sm font-light mt-10 sm:hidden">
				  Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития.
			  </p>
		  </div>
	  </div>
  </main>
</template>

<style scoped>

</style>